/* Задача 2: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, 
             стоящих на нечётных позициях.
                                         [3, 7, 23, 12] -> 19
                                         [-4, -6, 89, 6] -> 0 */
Console.WriteLine("Hello, World!");
